{
  "Articles" : [
    {
      "id" : 1,
      "title" : "Cara Belajar React Js dari Pemula sampai Mahir!",
      "post_date" : "24 November 2020",
      "hero_image" : "https://i.ibb.co/NTTMSW5/Cara-Belajar-React-Js-dari-Pemula-sampai-Mahir.webp",
      "text_article" : "Hi Coders! kali ini kita akan membahas roadmap untuk belajar React Js. Guide ini ditujukan untuk kalian semua yang akan atau sedang memulai belajar React. Oke, lansung saja kita bahas!\n\nPrasyarat\nSebelum memulai, ada beberapa prasyarat yang mesti kalian penuhi atau setidaknya sudah familiar dengan beberapa hal yang akan disebutkan di bawah ini:\nPengetahuan dasar tentang HTML, CSS, dan Javascript.\nPemahaman dasar tentang fitur-fitur ES6. Untuk dapat memulai setidaknya kalian harus tahu bebrapa hal ini:\nLet, Const, Arrow functions, Imports dan exports, Classes\nPemahaman dasar tentang cara penggunaan npm.\n\nMulai Belajar\nKita bisa menggunakan online code editor untuk latihan atau bisa juga menggunakan create-react-app.\nUntuk memahami semua dasar-dasar React, kita bisa mulai dengan tutorial berikut:\nReact official documentation dari React\nBeginners guide to react dari Kent C. Dodds\nFundamentals of React dari Sammer Buna\nSekarang setidaknya kita sudah tahu dasar dari React fundamental. Itu cukup untuk memulai mendevelop aplikasi sederhana menggunakan React.\n\nMulai Bangun Sebuah Proyek\nBerikut adalah beberapa ide aplikasi yang dapat kalian buat:\nReact to-do-app\nKalkulator sederhana\nMembanggun Shopping Cart\n\nReact Router\nReact Router membantu kita untuk membuat rute ke aplikasi dari satu halaman ke halaman lainnya. Ini sangat* powerfull* dan mudah digunakan dalam aplikasi React.\nUntuk memulainya bisa melihat beberapa referensi berikut:\nTutorial React Router dari Paul Sherman\nReact Router and intro to SPA dari Learn Code Academy\nRouting React apps dari Scotch.io\n\nContoh proyek\nAplikasi yang bisa kalian buat menggunakan React Router diantaranya:\nAplikasi CRUD sederhana\nHacker News clone\n\nWebpack\nWebpack adalah bundler modul JavaScript yang sangat terkenal. Webpack membantu kita mempertahankan dependensi sebagai file statis untuk proyek sehingga developer tidak perlu lagi melakukannya secara manual. Webpack juga dilengkapi dengan loader. Loader membantu menjalankan tugas tertentu di dalam proyek kita.\nUntuk mempelajarinya kalian bisa melihat dokumentasi dari webpack disini.\n\nServer Rendering\nRendering server adalah salah satu fitur paling keren di React. Ini dapat digunakan teknologi back-end apapun.\nServer Side Rendering (SSR) di React membantu kita membuat komponen di server dan menjadikannya sebagai HTML di browser. Dan ketika semua modul JavaScript diunduh di browser, React akan mengambil alih. Cukup sederhana bukan?\nPertama-tama coba cek dokumentasinya disini:\nReact-DOM API\nLalu ikuti dengan beberapa tutorial berikut:\nReact server rendering dari Tyler McGinnis\nReact router server rendering dari Roilan Salinas\nReact Server side rendering guide dari Dennis Brotzky\n\nRedux\nRedux adalah library JavaScript yang dikembangkan untuk memelihara aplication states. Saat kita membuat aplikasi yang kompleks, ini akan menambah overhead untuk mengelola state di seluruh komponen. Redux membantu kita menyimpan semua state dalam satu sumber. Dan tentu saja React bekerja dengan baik dengan Redux.\nUntuk mempelajarinya bisa mulai dengan:\nRedux tutorial dari Learn Code Academy\nRedux tutorial for beginners dari Valentino Gagliardi\nReact Redux dari CSS Tricks.\nTutorial ini lebih dari cukup untuk memulai belajar Redux.\nNah, sudah sedikit tercerahkan mengenai apa saja yang mesti dipelajari? Jika kalian bingung mengenai penjelasan di atas dan lebih suka belajar secara terstruktur, khususnya dalam bahasa Indonesia, tenang… Codepolitan punya solusinya. Kalian bisa mempelajari dasar-dasar React di kelas Belajar Cepat Membuat Web App Berbasis React dan setelah itu bisa melanjutkan materi yang lebih mendalam di kelas Membuat Web Kuliner Menggunakan React.js. Semua materinya lengkap dan pastinya tersedia dalam bahasa Indonesia. Jadi dijamin tidak akan ada kendala bahasa dalam mempelajari React.\nMungkin segitu aja dulu. Happy Coding 😃" 
    },
    {
      "id" : 2,
      "title" : "Beberapa Fitur HTML yang Jarang Anda Gunakan",
      "post_date" : " 1 December 2020",
      "hero_image" : "https://i.ibb.co/h7RM68r/Apakah-kamu-masih-menggunakan-lodash.jpg",
      "text_article" : "Coders, HTML ternyata banyak fungsionalitasnya lho. Ini beberapa fitur HTML yang mungkin saja jarang Anda gunakan.\n\nPicture\nTag <picture> memberi lebih banyak kontrol untuk menentukan sumber dari suatu gambar. Biasanya dipakai untuk gambar yang responsif.\n\nTag <picture> berisi dua tag: satu atau lebih tag <source> dan satu tag <img>.\n\nBrowser akan mencari elemen <source> pertama yang cocok dengan media query yang sudah ditentukan, yang didapat oleh atribut srcset. Jika tidak ada kueri media yang cocok, browser akan menggunakan elemen <img>.\n\nElemen <input> dengan type “color” bakal jadi color picker ketika diklik.\nDefault value-nya yaitu #000000 (Hitam)\n\nDatalist\nTag <datalist> dipakai untuk memberikan fitur autocomplete ke elemen <input>. User bisa melihat daftar drop-down dari <datalist> yang sudah dibuat.\n\nProgress\nBukan hanya framework seperti Bootstrap saja lho yang punya, vanilla HTML juga ada.\n\n\nJangan lupa, sesuai Principle of The Least Power, usahakan Anda memakai native HTML feature dulu 😉" 
    },
    {
      "id" : 3,
      "title" : "Membuat Prototype Mobile App dengan Adobe XD",
      "post_date" : "7 December 2020",
      "hero_image" : "https://static.cdn-cdpl.com/source/998b78e349061b4971c0a2b0e8d6be41/maxresdefault1.jpg",
      "text_article" : "Dalam membangun aplikasi, baik itu aplikasi berbentuk website, mobile ataupun desktop tentu memiliki tahapan-tahapan yang dimulai dengan menganalisa masalah hingga prilisan, dari hulu hingga hilir. Koding hanyalah sebagian kecil dalam membangun aplikasi. Biasanya sebelum tahap development/koding kita mesti melewati tahap desain terlebih dahulu agar dalam development dapat terarah dan terstruktur serta meminimalisir seringnya revisi. Tahap desain umumnya terdiri dari membuat mockup atau prototype.\nDi artikel ini, kita akan belajar bagaimana mendesain mockup dan prototype menggunakan Adobe XD yang telah dirilis Adobe secara cuma-cuma.\nCase study yang akan kita terapkan adalah bagaimana mendesain mockup dan prototype pada aplikasi mobile android CodePolitan yang dapat diunduh di Google PlayStore.\n\nPersiapan: Unduh dan Pemasangan\nPertama kita unduh aplikasi Adobe XD di website resminya Adobe. Sebelum mengunduh kita diwajibkan untuk login dan memasang Create Cloud Desktop App.\nSetelah itu klik Open Creative Cloud Desktop App pada popup.\nJika proses unduh telah sukses, kemudian kita buka aplikasi Adobe XD.\nBisa kita lihat bahwa dalam pembuatan project kita bisa langsung memilih jenis platform yang telah disediakan, bahkan dapat dibuat secara* custom size*.\n\nUser Interface Kits\nUI Kits ini adalah file Adobe XD yang berisi desain-desain User Interface yang telah di sediakan oleh pihak ketiga seperti UI Kits Iphone yag disediakan Apple, Wireframe Kits disediakan oleh Behance, Android Kits disediakan oleh Material Design, Microsoft Windows Kits disediakan oleh Microsoft dan lain sebagainya.\n\nMockup Landing Page\nSetelah Adobe XD telah sukses diunduh dan dipasang maka saatnya kita memulai dengan mendesain mockup. Bagi teman-teman yang sudah terbiasa dengan Adobe Photoshop dapat pula mendesain menggunakan alat tersebut dalam kata lain Adobe XD dapat di integrasikan dengan Adobe Photoshop."
    },
    {
      "id" : 4,
      "title" : "Format Kode Python Secara Otomatis di Sublime Text",
      "post_date" : "15 December 2020",
      "hero_image" : "https://static.cdn-cdpl.com/source/00600bfb26f44c7427a680235c2e3042/sublime.png",
      "text_article" : "Python merupakan salah satu bahasa pemrograman yang paling rewel untuk urusan kerapihan kode, khususnya indentasi. Meski begitu, adakalanya kita menyalin kode dari tempat lain dan berakhir dengan kode yang kacau. Daripada mengatur kode-kode tersebut secara manual, lebih baik gunakan formatter yang biasanya ada di text editor. Sublime Text misalnya, ada sebuah package bernama sublime_black yang akan memformat kode-kode Python secara otomatis.\n\nAgar bisa memakai package sublime_black, kita harus terlebih dahulu memasang black. Package sublime_black hanya antarmuka yang menjembatani antara black dengan Sublime agar kode yang ditulis bisa langsung diformat secara otomatis tanpa keluar editor. Memasang black sangat mudah, cukup eksekusi perintah : $ pip install black\nBlack membutuhkan Python 3.6.0+ agar bisa dipasang, namun bisa dipakai juga untuk memformat kode Python 2.\nSetelah black terpasang, sekarang tambahkan sublime_black dengan mengunduhnya ke folder Packages lalu restart SublimeText.\n$ git clone https://github.com/csurfer/sublime_black\nPerhatikan bahwa perintah di atas harus dieksekusi di folder Packages SulimeText. Untuk melihat dimana letak folder tersebut, klik menu Preferences > Browse Packages.\nUntuk saat ini sublime_black belum bisa dipasang lewat package control karena baru diunggah pada tanggal 1 Mei. Dalam beberapa hari kedepan seharusnya sudah bisa dipasang langsung lewat CTRL + SHIFT + P, Package Control: Install Package." 
    },
    {
      "id" : 5,
      "title" : "Progressive Web Apps (PWA) dengan Windows Desktop Chrome",
      "post_date" : "28 December 2020",
      "hero_image" : "https://static.cdn-cdpl.com/source/998b78e349061b4971c0a2b0e8d6be41/aa_1.png",
      "text_article" : "Perkembangan tahun ini (2018) untuk Progressive Web Apps (PWA) cukup signifikan. Dari pengumuman iOS 11.3 is available today dan berita First Windows 10 Progressive Web Apps (PWA) published by Microsoft hit the Store. Yang menunjukkan perkembangan dukungan tipe aplikasi ini lebih luas.\n\nAwalnya hanya dari Chrome sampai ke Android dan terus hampir dibanyak platform dan OS. Walaupun begitu PWA masih ‘malu-malu’ di-Windows hingga banyak yang tidak tahu ia sudah ada.\n\nAndroid\nBicara PWA di-Android akan seperti native untuk aplikasi jenis ini. Dan bukan sekadar WebView yang menjalankan web app, tapi ia tetap berjalan di-browser Chrome dengan tampilan yang berbeda.\nPengaturan default-nya Chrome di-Android untuk PWA adalah menawarkan Web tersebut menjadi ‘native’ aplikasi seperti layaknya ia dipasang dari Google Play.\nSeperti yang terlihat digambar, ketika membuka web ini. Chrome akan mendeteksi apakah ia PWA? Bila iya, ditawarkan untuk dipasang dalam Android-nya.\n\nWindows\nBagaimana Chrome di-Windows? Kenapa tidak bisa seperti yang terjadi di-Android.\nDukungan tipe aplikasi ini sudah lama ada di-Windows, tapi Chrome masih ‘malu-malu’. Oleh karena itu, sekarang kita akan buat Chrome berkelakuan seperti di-Android.\n\nChrome\nUntuk itu kita perlu merubah pengaturan yang ada didalam Chrome. Kita masuk ke chrome://flags/ lalu kita cari enable-app-banners.    \nDari sana kita enable-kan, Chrome akan meminta kita me-restart browser. Setelah itu ia siap untuk PWA di-Windows.\n\nPWA\nSekarang bila kita membuka site seperti diatas. Maka Chrome akan bertingkah laku seperti layaknya PWA di-Android.\nChrome akan menawarkan sebagai Chrome Apps.\n\nUninstall\nKarena ini adalah Web App Chrome, maka ia berada didalam folder Chrome Apps. Akan berbeda kalau kita memasang PWA dari Windows Store, yang notabene akan berjalan di-browser Edge dan meng-‘uninstall’-nya lewat tata cara Windows Store (ter-integrasi dengan Windows).\nOleh karena itu, meng-‘uninstall’-nya cukup kita hapus saja PWA tersebut. Ingat PWA ini berjalan diatas Chrome.\n\nPenutup\nPWA digadang-gadangkan menjadi prioritas aplikasi dalam lingkungan Google Fuchsia (OS setelah Chrome OS yang tidak menggunakan kernel linux lagi). Investasi besar yang dilakukan untuk PWA mulai memberikan hasil, sebagaimana yang makin diterimanya aplikasi jenis ini. Walaupun ada tantangan besar juga untuk itu, seperti efisiensi listrik(battery) dan penggunaan memory yang selalu rakus kalau kita bicara aplikasi dengan javascript."
    },
    {
      "id" : 6,
      "title" : "Mencegah Android Studio Membersihkan Pesan Log Saat Crash",
      "post_date" : "7 January 2021",
      "hero_image" : "https://static.cdn-cdpl.com/source/998b78e349061b4971c0a2b0e8d6be41/Android-App-Wallpaper.png",
      "text_article" : "Pembaca yang pernah membuat aplikasi Android pasti sering mengalami kasus saat kita ingin melihat pesan error di Logcat, tapi pesan tersebut tiba-tiba menghilang karena kita memilih OK di dialog crash. Untuk melihat pesan tersebut kita harus menjalankan aplikasi lagi, melakukan hal yang sama dengan yang sebelumnya kita lakukan baru bisa melihat pesan error yang tadinya menghilang. Terkadang error yang terjadi karena hal-hal yang tidak bisa kita prediksi atau harus melalui beberapa tahapan baru terjadi sehingga akan cukup merepotkan jika tiba-tiba Android Studio membersihkan pesan error.\nReferensi Tempat Belajar Android Development Berbahasa Indonesia\nPerilaku ini bisa kita ubah dengan mengatur Filter Configuration untuk jendela Logcat. Di sebelah kanan jendela Logcat, klik dropdown yang ada lalu pilih Edit Filter Configuration\nDi jendela baru yang muncul kita cukup menuliskan nama package di kolom Package Name dan memberikan nama Filter Name (sesuai keinginan)\n\nSemoga tutorial singkat ini membantu pembaca yang mengalami kesulitan yang sama dengan penulis." 
    },
    {
      "id" : 7,
      "title" : "MySQL CLI Query",
      "post_date" : "13 January 2021",
      "hero_image" : "https://static.cdn-cdpl.com/source/ccf15cfcef568a0f548de6dd42022aaf/cp-mysql.png",
      "text_article" : "Menggunakan Command-Line Interface(CLI pada MySQL biasa dilakukan, terutama bila dalam sesi SSH.\nCLI memiliki karakteristik yang cepat dan ringan, terutama jika perlu berinteraksi dengan perintah satu dengan yang lainnya.\n\nSalah satu kekurangan CLI ini, ketika berhadapan dengan banyak urutan perintah yang sekesinambungan.\nSeperti dengan Structured Query Language(SQL), yang kadang panjang sekali.\n\nMari kita lihat kenapa CLI ini bisa membuat bekerja dengan SQL menjadi kurang asik.\n\nPertama kita masuk ke CLI MySQL\nDan kita akan menggunakan schema db. Laku kita kirim SQL.\nKalau kita tidak menaruh ;, maka CLI tidak akan menjalankan perintah SQL-nya.\nYang terjadi adalah CLI akan membuat line feed untuk menuliskan kelanjutan dari SQL-nya. Dan itu baru terhenti apabila ada karakter ; .\n\nKalau kita tidak ingin menjalankan SQL tersebut, kita tinggal beri perintah clear. Maka CLI akan menghapus dari memori dan bersiap menerima perintah baru.\n\nJadi masalah, pada saat kita dalam multi-line. Kita tidak bisa kembali ke-atas, untuk meng-edit perintah sebelum kita berikan tanda ; .\n\nDalam Unix/Linux CLI kadang terinterasi dengan aplikasi tertentu yang membantu meng-edit, tapi itupun terbatas. Oleh karena itu apabila kita bekerja dengan SQL yang dibuat bersarang atau banyak baris. Lebih baik menggunakan file untuk menuliskan, setelah itu baru dijalankan oleh CLI\n\nPenutup\nCLI cenderung digunakan untuk perintah-perintah yang tidak terdiri dari banyak baris, terutama bila kita ingin memodifikasi perintah-perintah yang ada.\nDengan menggunakan berkas yang berisi perintah-perintah atau SQL kita bisa lebih nyaman bekerja dengan CLI." 
    },
    {
      "id" : 8,
      "title" : "Website Interaktif dengan Typed.js",
      "post_date" : "2 February 2021",
      "hero_image" : "https://static.cdn-cdpl.com/source/2dd7d3ba70bcbe34f8b0d7242c773a78/LOGO1.png",
      "text_article" : "Typed.js adalah plugin JavaScript yang memberikan efek teks menulis secara otomatis pada website kita sesuai dengan tujuan Javascript yang menjadikan website menjadi interaktif. Typed.js ini dibuat oleh Matt Boldt di Texas, US.\n\nUntuk mendapatkan plugin Typed.js ini dapat diunduh dengan tiga cara sesuai keinginan.\n1.File ZIP pada web resmi Typed js.\n2.Link CDN ( https://cdnjs.cloudflare.com/ajax/libs/typed.js/2.0.8/typed.min.js )\n3.Package manager pada Command prompt/Terminal" 
    },
    {
      "id" : 9,
      "title" : "Belajar Membuat Aplikasi Android dengan Kotlin",
      "post_date" : "28 February 2021",
      "hero_image" : "https://static.cdn-cdpl.com/source/c7a41e9ac693eba07e1b036591d95601/kotlinjava.png",
      "text_article" : "Beberapa waktu yang lalu di Codepolitan, ada sebuah artikel yang membahas Belajar Membuat Aplikasi Android dengan Kotlin Untuk Pemula Bagian 1: Activity dan Layout. Nah setelah mengetahui tentang activity dan Layout sekarang kita akan membuat sebuah form login. Form login yang akan kita buat sekarang seperti ini\n\nKalau belum dijalankan bagaimana kita bisa tahu hasilnya? Untuk menjalankan program dari Android Studio kita perlu memiliki sebuah emulator atau menggunakan perangkat Android asli. Silahkan ikuti tutorial berikut ini untuk menjalankan aplikasi di emulator atau perangkat Android asli.\n\nPenutup\nDemikian tutorial membuat form Login kali ini. Selanjutnya kita akan belajar Membuat aplikasi lain. Semoga bisa dipahami oleh pembaca sekalian. Jika ada kritik, saran, pertanyaan atau request silahkan melalui kolom komentar saja ya." 
    },
    {
      "id" : 10,
      "title" : "Memahami Jenis-jenis Satuan Ukuran di CSS",
      "post_date" : "2 March 2021",
      "hero_image" : "https://static.cdn-cdpl.com/compressed/satuan-css.webp",
      "text_article" : "CSS memiliki beberapa opsi satuan untuk menentukan ukuran dari berbagai propertinya. Menggunakan jenis-jenis satuan yang bisa dipakai oleh CSS akan menjadi kunci membuat layout yang mudah dikeloa dan terlihat bagus disemua jenis layar.\n\nApa itu CSS Unit?\nCSS unit adalah satuan untuk menentukan ukuran dari suatu elemen atau kontennya. Misal, jika ingin menentukan margin dari sebuah paragraf, kita bisa memberikan nilai tertentu. Nilai ini akan diikuti oleh satuan (CSS unit).\n\nAbsolute vs Relative\nSaat menentukan ukuran, hal yang paling penting adalah memikirkan akan mengguankan salah satu dari dua kategori ini: absolute atau relative.\n\nAbsolute Unit\nUnit yang “absolute” akan selalu memiliki ukuran yang sama apapun elemen parent-nya atau ukuran layar. Artinya properti yang diatur dengan absolute unit akan memiliki ukuran sama baik di telepon maupun di layar monitor yang besar.\nAbsolute unit berguna jika project yang dikerjakan tidak memikirkan keresponsifan. Misalnya, aplikasi desktop yang tidak bisa di-resized bisa menggunakannya. Jika ukuran jendela tidak akan berubah, maka kontennya pun tidak juga.\nPixel (px) sering dipakai untuk menentukan absolute unit di layar. Centimeter, millimeter, dan inchi lebih sering dipakai untuk dokumen cetak (kamu mungkin tidak tgerpikirkan kalau tiga opsi ini bisa dipakai).\n\nRelative Unit\nRelative unit berguna untuk mendesain website yang responsif karena ukurannya bisa berubah relatif terhadap parent atau ukuran layar.\nSecara umum relative unit bisa dipakai sebagai satuan bawaan website responsif sehingga bisa membantu untuk meng-update style di ukuran layar yang berbeda.\nRelative unit mungkin akan sedikit lebih sulit dibandingkan absolute unit untuk menentukan satuan mana yang akan dipakai.\n\n%: Ukurannya relatif terhadap parent element\nem: Ukurannya relatif terhadap font-size dari elemen saat ini\nrem: Ukurannya relatif terhadap font-size root elemen (<html>). 'rem' = 'root em'\nch: Ukurannya mengikuti jumlah karakter (1 karakter sama dengan lebar dari karakter 0/nol font yang sedang aktif)\nvh: Ukurannya relatif terhadap tinggi viewport (ukuran jendela tau aplikasi), 1vh = 1/100 dari tinggi viewport\nvw: Ukurannya relatif terhadap lebar dari viewport. 1vw = 1/100 lebar viewport\nvmin: Ukurannya relatif terhadap ukuran viewport yang lebih kecil (misalnya diorientasi portrait, lebar akan lebih kecildaripada tinggi). 1vmin = 1/100 dari ukuran viewport yang lebih kecil.\nvmax: Sama dengan vmin, dia akan melihat ukuran viewport yang lebih besar\nex: Ukurannya relatif terhadap tinggi dari karakter “x” kecil font yang sedang aktif." 
    }
  ]
}